#include<iostream>
#include<cmath>         //для корня
using namespace std;


//функция для функции задачи базового уровня
double average(double a,double b)       //функция поиска среднего арифметического
{
    return (a+b)/2;         //среднее арифметическое
}


//функция для задачи базового уровня
void base()
{
    double a,b;     //объявил переменные
    cout << "Введите числа а и b " << "\n";     //предложение ввода
    cin >> a >> b;                              //ввод
    if (cin.fail())                             //проверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Ошибка ввода, введите числа" << "\n";      //сообщение об ошибке ввода
        return;
    }
    cout << "Среднее арифметическое чисел = " << average(a,b) << "\n";      //вывод результата
}


//функция для функции задачи срденего уровня
int lcm(int a,int b)        //функция поиска нок
{
    int nok{a};         //инициализация нок=а для корректной работы ифа
    if (b>a)            //нок должен быть равен наибольшему числу из заданных
    {
        nok=b;          //если б больше тогда нок=б
    }
    while (nok%a!=0 || nok%b!=0)        //цикл поиска нок
    {
        nok++;                          //если это не нок тогда увеличивается
    }
    return nok;                         //нок
}


//функция для задачи среднего уровня
void medium()
{
    int a,b;                //объявление переменных
    cout << "Введите числа а и b" << "\n";          //предложение ввода
    cin >> a >> b;                                  //ввод
    if (cin.fail() || a<=0 || b<=0)                 //проверка ввода и что числа положительные
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Ошибка ввода, введите положительные числа" << "\n";        //сообщение об ошибке ввода
        return;
    }
    cout << "НОК чисел а и b = " << lcm(a,b) << "\n";                       //вывод результата
}


//функция для функции повышенного уровня
int solveQuadratic(double a,double b,double c, double &x1, double &x2)          //функция решения квадратного уравнения
{
    double d{b*b-4*a*c};        //дискриминант
    int ans{0};                 //инициализация счеткчика количества корней
    if (d<0)                    //дискриминант меньше 0 
    {
        ans=0;                  //нет действительных корней
    }
    else if (d==0)              //дискриминант=0
    {
        ans=1;                  //1 корень
        x1=-b/(2*a);            //значение корня 
    }
    else                        //дискриминант больше 0
    {
        ans=2;                  //2 корня
        x1=(-b+sqrt(d))/(2*a);  //первый корень
        x2=(-b-sqrt(d))/(2*a);  //второй корень
    }
    return ans;        //количество корней
}


//функция для задачи повышенного уровня
void advanced()
{
    double a,b,c,x1{0},x2{0};       //объявил коэффициенты и инициализировал корни
    cout << "Введите коэффициенты a b и c квадратного уравнения " << "\n";      //предложение ввода
    cin >> a >> b >> c;     //ввод
    if (cin.fail())         //проверка ввода
    {
        cin.clear();        
        cin.ignore(10000,'\n');
        cout << "Ошибка ввода" << "\n"; //сообщение об ошибке ввода
        return;
    }
    if (a==0)       //уравнение не квадратное
    {
        cout << "Коэффициент а не должен быть = 0 " << "\n";        //сообщение об ошибке
        return;
    }
    int result=solveQuadratic(a,b,c,x1,x2);             //количество корней
    switch(result)          //через свитч 
    {
        case 0:         //нет действительных корней
        cout << "Нет действительных корней" << "\n";    //сообщение если нет действительных корней
        break;
        case 1:         //1 корень
        cout << "Корней " << result << "\n" << "Корень уравнения = " << x1 << "\n";     //вывод количества корней и самого корня
        break;
        case 2:         //2 корня
        cout << "Корней " << result << "\n" << "Первый корень уравнения = " << x1 << "\n" << "Второй корень уравнения = " << x2 << "\n";    //вывод количества корней и самих корней
        break;
        default:        //значение не из кейсов
        cout << "Ошибка" << "\n";       //сообщение об ошибке
    }
}


int main()
{
    int task_level; //переменная уровня задачи
    cout << "Выберите уровень программы" << "\n" << "1 базовый" << "\n" << "2 средний" << "\n" << "3 повышенный" << "\n"; //предложение выбора уровня задачи
    cin >> task_level; //ввод уровня задачи
    if (cin.fail())     //проверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Ошибка ввода, введите 1 или 2 или 3";  //сообщение об ошибке ввода
        return 0;
    }
    switch(task_level)      //обработка выбора уровня через свитч
    {
        case 1: base();         //базовый
        break;
        case 2: medium();           //средний
        break;
        case 3: advanced();             //повышенный
        break;
        default: 
        cout << "Введен неверный уровень задания, введите 1 или 2 или 3";       //ввели другое
        return 0;
    }
    return 0;
}