#include<iostream>
#include<string>        //для строк
using namespace std;


//функция для задачи базового уровня
void base()
{
    string s;       //создал строку
    cout << "Введите строку" << "\n";       //предложил ввод
    getline(cin,s);             //ввод через гетлайн тк не знаю какие могут быть входные данные
    for (char& c:s)              //иду циклом по строке. ссылка чтобы менять конкретно элемент строки потому что если убрать ссылку цикл будет создавать копию элемента и менять копию а не элемент
    {
        if (c=='a')             //если а попадается то меняю
        {
            c='b';              //меняю присваиванием
        }
    }
    cout << "Строка после замены a на b: " << s << "\n";        //вывод результата
}


//функция для задачи среднего уровня
void medium()
{
    string s;       //создал строку
    cout << "Введите строку" << "\n";       //предлодил ввод
    getline(cin,s);             //ввод через гетлайн тк не знаю какие могут быть входные данные
    if (s.find('x')==string::npos)          //если х отсутсвует в строку
    {
        cout << -1;                         //вывожу -1 как треубет задание
    }
    else                                    //если х все же есть
    {
        cout << "Позиция первого вхождения символа х: " << s.find('x') << "\n";        //вывод результата
    }
}


//функция для задачи повышенного уровня
void advanced()
{
    string s;           //создал строку
    cout << "Введите строку" << "\n";           //предложил ввод
    getline(cin,s);                             //ввод через гетлайн тк не знаю какие могут быть входные данные
    cout << "Все возможные подстроки заданной строки: " << "\n";            //офромление вывода
    for (int i=0;i<s.length();i++)                //иду циклами по строке
    {
        for (int j=1;j<=s.length()-i;j++)            //для подстрок
        {
            cout << s.substr(i,j) << " ";           // вывожу подстроки 
        }
    }
}


int main()
{
    int task_level; //переменная уровня задачи
    cout << "Выберите уровень программы" << "\n" << "1 базовый" << "\n" << "2 средний" << "\n" << "3 повышенный" << "\n"; //предложение выбора уровня задачи
    cin >> task_level; //ввод уровня задачи
    if (cin.fail())     //проверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Ошибка ввода, введите 1 или 2 или 3";  //сообщение об ошибке ввода
        return 0;
    }
    cin.ignore(10000, '\n');        //из-за гетлайнов 
    switch(task_level)      //обработка выбора уровня через свитч
    {
        case 1: base();         //базовый
        break;
        case 2: medium();           //средний
        break;
        case 3: advanced();             //повышенный
        break;
        default: 
        cout << "Введен неверный уровень задания, введите 1 или 2 или 3";       //ввели другое
        return 0;
    }
    return 0;
}