#include<iostream>
#include<cmath>                 //для pow fmod 
using namespace std;

//функция для задания базового уровня 
void base()     
{
    int number;     //объявил переменную номера месяца
    cout << "Введите номер месяца" << "\n";             //предложение ввести номер месяца
    cin >> number;                  //ввод номера месяца
    if (cin.fail())             //проверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Введен неверный тип данных, введите число" << "\n";        //сообщение об ошибке
        return;
    }
    switch(number)              //реализация задания через свитч
    {
        case 1: case 3: case 5: case 7: case 8: case 10: case 12: cout << "Количество дней в месяце = " << 31 << "\n";  // для всех месяцев в которых 31 день
        break;
        case 4: case 6: case 9: case 11: cout << "Количетсво дней в месяце = " << 30 << "\n";   //для всех месяцев в которых 30 дней
        break;
        case 2: cout << "Количество дней в месяце = " << 28 << "\n";        //для всех месяцев в которых 28 дней
        break;
        default: cout << "Введен неверный номер месяца, введите номер 1-12" << "\n";            //если введен номер не из промежутка 1-12
    }
}

//функция для задания среднего уровня
void medium()
{
    double num1,num2;           //переменные для операций
    int operation{-1};              //переменная выбора операций -1 для корректной работы вайла
    while (operation!=0)            //вайл чтобы можно было несколько раз использовать не перезапуская программу
    {
        cout << "Выберите операцию " << "\n" << "1 Сложение(+)" << "\n" << "2 Вычитание(-)" << "\n" << "3 Умножение(*)" << "\n" << "4 Деление(/)" << "\n" << "5 Возведение в степень(^)" << "\n" << "6 Остаток от деления(%)" << "\n";    //предложение ввода
        cout << "Чтобы завершить программу введите 0" << "\n";   //что делать чтобы остановить программу
        cin >> operation;       //ввод операции 
        if (cin.fail())         //проверка ввода
        {
            cin.clear();
            cin.ignore(10000,'\n');
            cout << "Введен неверный тип данных, введите число";        //сообщение об ошибке ввода
            continue;
        }
        if (operation==0)           //завершение если пользователь выбрал завершить
        {
            break;
        }
        cout << "Введите числа для операции " << "\n";          //предложение ввода чисел для дальнейших операций
        cin >> num1 >> num2;                    //ввод чисел для операций
        if (cin.fail())                 //проверка ввода 
        {
            cin.clear();
            cin.ignore(10000,'\n');
            cout << "Введен неверный тип данных, введите числа";        //сообщение об ошибке ввода
            continue;
        }
        switch(operation)               //реализация программы через свитч
        {
            case 1: cout << "Сумма чисел = " << num1+num2 << "\n";          //сумма чисел
            break;
            case 2: cout << "Разность чисел = " << num1-num2 << "\n";       //разность чисел
            break;
            case 3: cout << "Произведение чисел = " << num1*num2 << "\n";       // произведение чисел
            break;
            case 4:         //деление чисел с проверкой чтобы второе число не было =0
            if (num2==0)
            {
                cout << "Ошибка, деление на 0 невозможно" << "\n";          //если второе число ноль
                continue;
            }
            else    
            {
                cout << "Частное чисел = " << num1/num2 << "\n";        //если второе число не 0
            }
            break;
            case 5: cout << "Число " << num1 << " в степени " << num2 << " = " << pow(num1,num2) << "\n";           //возведение в степеь
            break;
            case 6:             //остаток от деления 
            if (num2==0)
            {
                cout << "Ошибка, деление на 0 невозможно";          //если второе число ноль
            }
            else
            {
                cout << "Остаток от деления " << num1 << " на " << num2 << " = " << fmod(num1,num2) << "\n";        //если второе число не ноль
            }
            break;
            default: 
            cout << "Введен неверный номер операции" << "\n";           //если введено число не из промежутка чисел операций
            break;
        }
    }
}

//функция для заданния повышенной сложности   тоже через вайл
void advanced()
{
    int category{-1};       //инициализация переменных -1 для вайла 
    int product{-1};
    double check{0}, discount{0};       //переменная чека и скидки
    int ans{0};             //счетчик купленных товаров
    cout << "Добро пожаловать в магазин" << "\n";           //приветствие 
    while (category!=0)         //главный вайл
    {
        cout << "Магазин" << "\n" << "Выберите категорию:" << "\n" << "1 Электроника" << "\n" << "2 Книги" << "\n" << "3 Одежда" << "\n" << "4 Еда" << "\n";  //категории магазина
        cout << "Введите 0 чтобы завершить покупки" << "\n";        //выход из вайла
        product=-1;       //переменная сбрасывается каждый раз чтобы можно было несколько вещей из разных категорий купить
        cin >> category;        //ввод категории
        if (cin.fail())         //проверка ввода
        {
            cin.clear();
            cin.ignore(10000,'\n');
            cout << "Введен неверный тип данных, введите число";    //сообщение об ошибке ввода
            continue;
        }
        switch(category)        //реализация категории через свитч
        {
        case 1:         //электронника
        while (product!=0)          //тоже вайл чтобы можно было добавить несколько товаров
        {
            cout << "Выберите товар" << "\n" << "1 Клавиатура 7000 рублей" << "\n" << "2 Мышь 5000 рублей" << "\n" << "3 Компьютер 250000 рублей" << "\n" << "0 Вернуться назад" << "\n";   //ассортимент и предложение вернуться назад
            cin >> product;     //ввод выбранного продукта
            if (cin.fail())     //проверка ввода
            {   
                cin.clear();
                cin.ignore(10000,'\n');
                cout << "Введен неверный тип данных, введите число";        //сообщение об ошибке ввода
                continue;
            }
            switch(product)         //работы программы при выборе того или инного продукта
            {
                case 1: //клавиатура
                check+=7000;        //сумма чека увеличивается
                ans++;          //количество товаров в корзине увеличивается
                cout << "Клавиатура добавлена в корзину" << "\n" << "Товаров в корзине " << ans << "\n" << "Общая стоимость товаров в корзине " << check << "\n";  //сообщение при выборе клавиатуры 
                break;
                case 2:             //мышь
                check+=5000;        //сумма чека увеличивается
                ans++;              //количество товаров в корзине увеличивается
                cout << "Мышь добавлена в корзину" << "\n" << "Товаров в корзине " << ans << "\n" << "Общая стоимость товаров в корзине = " << check << "\n";   //сообщение при выборе мыши
                break;
                case 3:   //компьютер
                check+=250000;          //сумма чека увеличиваетс
                ans++;                  //количество товаров в корзине увеличивается
                cout << "Компьютер добавлен в корзину" << "\n" << "Товаров в корзине " << ans << "\n" <<  "Общая стоимость товаров в корзине = " << check << "\n";  //сообщение при выборе компьютера
                break;
                case 0:     //вернуться назад
                break;
                default:
                cout << "Ошибка, выбран неверный пункт";        // если ввели число которого нет в кейсах
                break;
            }
        }
        break;
        case 2:         //книги
        while (product!=0)      //вайл чтобы покупать много книг сразу
        {
            cout << "Выберите товар" << "\n" << "1 Книга по python 1000 рублей" << "\n" << "2 Книга по с++ 1500 рублей" << "\n" << "3 Книга по алгоритмам 1200 рублей" << "\n" << "0 Вернуться назад" << "\n"; //ассортимент и предложение вернуться назад
            cin >> product; // ввод выбора продукта 
            if (cin.fail())         //проверка ввода
            {
                cin.clear();
                cin.ignore(10000,'\n');
                cout << "Введен неверный тип данных, введите число";    //сообщение об ошибке ввода
                continue;
            }
            switch(product)     //выбор конкретного продукта
            {
                case 1:     //книга python
                check+=1000;    //сумма чека увеличивается
                ans++;          //количество товаров в корзине увеличивается
                cout << "Книга по python добавлена в корзину" << "\n" << "Товаров в корзине " << ans << "\n" << "Общая стоимость товаров в корзине = " << check << "\n";//сообщение при выборе книги python
                break;
                case 2:         //книга с++
                check+=1500;        //сумма чека увеличивается
                ans++;              //количество товаров в корзине увеличивается
                cout << "Книга по c++ добавлена в корзину" << "\n" << "Товаров в корзине " << ans << "\n" << "Общая стоимость товаров в корзине = " << check << "\n";//сообщение при выборе книги c++
                break;
                case 3:     //книга алгоритмы
                check+=1200;        //сумма чека увеличивается
                ans++;              //количество товаров в корзине увеличивается
                cout << "Книга по алгоритмам добавлена в корзину" << "\n" << "Товаров в корзине " << ans << "\n" << "Общая стоимость товаров в корзине = " << check << "\n";//сообщение при выборе книги алгоритмы
                break;
                case 0://вернуться назад
                break;
                default:
                cout << "Ошибка, выбран неверный пункт";        //введено число не из предложенных
                break;
            }
        }
        break;
        case 3:     //одежда
        while (product!=0)  //вайл чтобы купить много одежды
        {
            cout << "Выберите товар" << "\n" << "1 Ботинки 15000 рублей" << "\n" << "2 Куртка 20000 рублей" << "\n" << "3 Джинсы 7000 рублей" << "\n" << "0 Вернуться назад" << "\n";//ассортимент и предложение вернуться назад
            cin >> product;         //ввод выбранного продукта
            if (cin.fail())         //проверка ввода
            {
                cin.clear();
                cin.ignore(10000,'\n');
                cout << "Введен неверный тип данных, введите число";        //сообщение об ошибке ввода
                continue;
            }
            switch(product)             //выбрали конкретный продукт
            {
                case 1:         //ботинки
                check+=15000;           //сумма чека увеличивается
                ans++;                  //количество товаров в корзине увеличивается
                cout << "Ботинки добавлены в корзину" << "\n" << "Товаров в корзине " << ans << "\n" << "Общая стоимость товаров в корзине = " << check << "\n";        //сообщение если ботинки
                break;
                case 2:         //куртка
                check+=20000;           //сумма чека увеличивается
                ans++;                  //количество товаров в корзине увеличивается
                cout << "Куртка добавлена в корзину" << "\n" << "Товаров в корзине " << ans << "\n" << "Общая стоимость товаров в корзине = " << check << "\n";//сообщение если куртка
                break;
                case 3:     //джинсы
                check+=7000;            //сумма чека увеличивается
                ans++;                  //количество товаров в корзине увеличивается
                cout << "Джинсы добавлены в корзину" << "\n" << "Товаров в корзине " << ans << "\n" << "Общая стоимость товаров в корзине = " << check << "\n";//сообщение если джинсы
                break;
                case 0:     //вернуться назад
                break;
                default:
                cout << "Ошибка, выбран неверный пункт";        //если выбран пункт не из предлодженных
                break;
            }
        }
        break;
        case 4:     //еда
        while (product!=0)      //вайл чтобы много еды купить
        {
            cout << "Выберите товар" << "\n" << "1 Огурец 50 рублей" << "\n" << "2 Бутерброд 150 рублей" << "\n" << "3 Чай 70 рублей" << "\n" << "0 Вернуться назад" << "\n";  //ассортимент и предложение вернуться назад
            cin >> product;   ///ввод продукта
            if (cin.fail()) //проверка ввода
            {
                cin.clear();
                cin.ignore(10000,'\n');
                cout << "Введен неверный тип данных, введите число";    //сообщение об ошибке ввода
                continue;
            }
            switch(product)     //выбрали конкретный продукт
            {
                case 1:     //огурец
                check+=50;          //сумма чека увеличивается
                ans++;              //количество товаров в корзине увеличивается
                cout << "Огурец добавлен в корзину" << "\n" << "Товаров в корзине " << ans << "\n" << "Общая стоимость товаров в корзине = " << check << "\n";//сообщение если огурец
                break;
                case 2:     //бутерброд
                check+=150;         //сумма чека увеличивается
                ans++;              //количество товаров в корзине увеличивается
                cout << "Бутерброд добавлен в корзину" << "\n" << "Товаров в корзине " << ans << "\n" << "Общая стоимость товаров в корзине = " << check << "\n";//сообщение если бутерброд
                break;
                case 3: //чай
                check+=70;          //сумма чека увеличивается
                ans++;              //количество товаров в корзине увеличивается
                cout << "Чай добавлен в корзину" << "\n" << "Товаров в корзине " << ans << "\n" << "Общая стоимость товаров в корзине = " << check << "\n";//сообщение если чай
                break;
                case 0://вернуться назад
                break;
                default:
                cout << "Ошибка, выбран неверный пункт";        //выбран пункт не из предложенных
                break;
            }
        }
        break;
        default:
        cout << "Ошибка, такой категории нет";          //введена категория не из перечисленных
        break;
        }
    }
    int card;       //наличие карты вип
    int stud;       //наличие студенческого
    cout << "У вас есть vip карта?" << "\n" << "1 да " << "\n" << "2 нет" << "\n";       //вопрос есть ли вип карта
    cin >> card;        //ввод ответа есть ли карта
    if (cin.fail())     //проверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Введен неверный тип данных, введите число"; //сообщение об ошибке ввода
        return;
    }
    switch(card)        //свитч для карты и студенческого
    {
        case 1://есть вип карта
        cout << "Ваша скидка 10%" << "\n";//сообщение о скидке
        discount=check*0.1; //сумма скидки
        cout << "Чек" << "\n" <<  "Сумма " << check << "\n" << "Скидка 10%" << "\n" << "Сумма скидки " << discount << "\n" << "Количество товаров "<< ans << "\n" << "К оплате " << check-discount << "\n" << "Спасибо за покупку"; //вывод чека
        break;
        case 2:         //нет вип карты
        cout << "У вас есть студенческий?" << "\n" << "1 да " << "\n" << "2 нет " << "\n";  //есть ли студенческий? варианты ответа да нет
        cin >> stud;        //ответ на вопрос
        if (cin.fail())     //проверка ввода
        {
            cin.clear();
            cin.ignore(10000,'\n');
            cout << "Введен неверный тип данных, введите число"; ///сообщение об ошибке ввода
            return;
        }
        switch(stud)//варианты со студенческим 
        {
            case 1://есть
            discount=check*0.05;//сумма скидки
            cout << "Чек" << "\n" <<  "Сумма " << check << "\n" << "Скидка 5%" << "\n" << "Сумма скидки " << discount << "\n" << "Количество товаров "<< ans << "\n" << "К оплате " << check-discount << "\n" << "Спасибо за покупку";  //вывод чека
            break; 
            case 2: //нет 
            discount=0; //скидки нет тогда
            cout << "Чек" << "\n" <<  "Сумма " << check << "\n" << "Скидка 0%" << "\n" << "Сумма скидки " << discount << "\n" << "Количество товаров "<< ans << "\n" << "К оплате " << check-discount << " рублей" << "\n" << "Спасибо за покупку";        //вывод чека
            break;
            default:
                cout << "Ошибка, неверный ввод" << "\n";  //ввели что-то не то
                break;
        }
        break;
        default:
            cout << "Ошибка, неверный ввод" << "\n";    //неверный ввод
            break;
    }
}


int main()
{
    int task_level; //переменная уровня задачи
    cout << "Выберите уровень программы" << "\n" << "1 базовый" << "\n" << "2 средний" << "\n" << "3 повышенный" << "\n"; //предложение выбора уровня задачи
    cin >> task_level; //ввод уровня задачи
    if (cin.fail())     //проверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Ошибка ввода, введите 1 или 2 или 3";  //сообщение об ошибке ввода
        return 0;
    }
    switch(task_level)      //обработка выбора уровня через свитч
    {
        case 1: base();         //базовый
        break;
        case 2: medium();           //средний
        break;
        case 3: advanced();             //повышенный
        break;
        default: 
        cout << "Введен неверный уровень задания, введите 1 или 2 или 3";       //ввели дпугое
        return 0;
    }
    return 0;
}
