#include <iostream>
#include<cmath>         //для математических функций
#include<iomanip>       //для вывода
using namespace std;
const double epsilone = 1e-9;       //для точности работы с дробными числами


//функция базового уровня
void base()
{
    double a,b,h,y;   //объявил переменные 
    cout << "Табуляция функции y=-(x*x)+4*x" << "\n" << "Введите числа a,b,h" << "\n"; //предложение ввода a b h
    cin >> a >> b >> h;             //ввод переменных
    if (cin.fail() || a>b || h<=0)     //проверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Ошибка ввода, числа должны быть чтобы a<b и h>0";  //сообщение об ошибке ввода
        return;
    }
    cout << "x\t\ty" << "\n";       //оформление таблицы
    cout << "-----------------" << "\n";     //оформление таблицы
    for (double x = a;x <= b + epsilone;x += h)     //цикл расчета и вывода таблицы
    {
        y=-(x*x)+4*x;       //f(x) расчет функции
        cout << x << "\t\t" << y << "\n";       //вывод результата
    }
}


//функция среднего уровня
void medium()
{
    double a,b,h,y,sumy{0},ans{0};         //объявил переменные
    cout << "Табуляция функции y=x*sin(x)" << "\n" << "Введите числа a,b,h" << "\n"; //предложение ввода a b h
    cin >> a >> b >> h;             //ввод переменных
    if (cin.fail() || a>b || h<=0)     //проверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Ошибка ввода, числа должны быть чтобы a<b и h>0";  //сообщение об ошибке ввода
        return;
    }
    double minX{a},minY{a*sin(a)},maxX{a},maxY{a*sin(a)};   //еще переменные
    cout << "x\t\ty" << "\n";       //оформление таблицы
    cout << "----------------" << "\n";     //оформление таблицы
    for (double x = a;x <= b + epsilone;x += h)     //цикл расчета и вывода таблицы
    {
        y=x*sin(x);       //f(x) расчет функции
        ans++;              //увеличение количества табуляций??
        sumy+=y*y;        //увеличение суммы квадратов значений функций
        if (y<minY)         //для поиска минимального значения функции 
        {
            minY=y;         
            minX=x;
        }
        if (y>maxY)             //для поиска максимального значения функции 
        {
            maxY=y;
            maxX=x;
        }
        cout << x << "\t\t" << y << "\n";       //вывод результата
    }
    cout << "----------------" << "\n";         //конец таблицы
    cout << "Результаты поиска:" << "\n" << "Количество значений функции " << ans << "\n" << "Сумма квадратов значений функции " << sumy << "\n";     //результаты поиска
    cout << "Минимум: x*sin("<<minX<<")="<<minY<< "\n";             //результаты поиска
    cout << "Максимум: x*sin("<<maxX<<")="<<maxY<< "\n";            //результаты поиска
}


//функция для функции повышенного уровня
double f(double x,double y)
{
    return (x+y)*(x+y);
}


//функция повышенного уровня
void advanced()
{
    double a,b,h,z;       //объявил переменные
    cout << "Табуляция функции f(x,y)=(x+y)^2" << "\n" << "Введите числа a,b,h" << "\n";        //предложение ввода
    cin >> a >> b >> h;     //ввод
    if (cin.fail() || a>b || h<=0)     //проверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Ошибка ввода, числа должны быть чтобы a<b и h>0";  //сообщение об ошибке ввода
        return;
    }
    cout << "Матрица значений z = f(x,y)" << "\n";       //оформление таблицы
    cout << "-------------------" << "\n";     //оформление таблицы
    for (double x=a;x<=b+epsilone;x+=h)     //вложенные циклы для z=f(x,y) и вывод в виде матрицы
    {
        for (double y=a;y<=b+epsilone;y+=h)     //сделал тоже по а и b так как по условию задачи не очень понял что от меня требуется
        {
            z=f(x,y);               //вычисление функции
            cout << z << "\t";      //вывод результата
        }
        cout << "\n";               // в виде матрицы
    }
    cout << "-------------------" << "\n";     //оформление таблицы
}


int main()
{
    int task_level; //переменная уровня задачи
    cout << "Выберите уровень программы" << "\n" << "1 базовый" << "\n" << "2 средний" << "\n" << "3 повышенный" << "\n"; //предложение выбора уровня задачи
    cin >> task_level; //ввод уровня задачи
    if (cin.fail())     //проверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Ошибка ввода, введите 1 или 2 или 3";  //сообщение об ошибке ввода
        return 0;
    }
    switch(task_level)      //обработка выбора уровня через свитч
    {
        case 1: base();         //базовый
        break;
        case 2: medium();           //средний
        break;
        case 3: advanced();             //повышенный
        break;
        default: 
        cout << "Введен неверный уровень задания, введите 1 или 2 или 3";       //ввели дпугое
        return 0;
    }
    return 0;
}
