#include <iostream>
#include <cmath>                //подключил для корня и модуля
#include<vector>                //подключил для массива в задаче повышенной сложности
#include <algorithm>            // подключил для сортировки массива в задаче повышенной сложности
using namespace std;


void base()                        //функция базового уровня
{
    double a,b,c;                      //объявление переменных
    cout << "Введите три числа" << "\n";            //предложение ввода
    cin >> a >> b >> c;                         //ввод
    if (cin.fail())                             //вроверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Введен неверный тип данных, введите числа" << "\n";            //предупреждение об ошибке
        return;
    }
    double suma{a+b+c};                     //инициализация и расчет переменной 
    if (suma>100)                           //проверка условия
    {
        cout << "Большая сумма" << "\n";        //вывод если sum>100
    }
    else
    {
        cout << "Сумма чисел = " << suma << "\n";           //вывод если sum<100
    }
}


void medium()                                   //функция среднего уровня
{
    double num;                                 //объявление переменной
    cout << "Введите число" << "\n";               //предложение ввода
    cin >> num;                                     //ввод
    if (cin.fail())                                 //проверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Введен неверный тип данных, введите число" << "\n";            //предупреждение об ошибке
        return;
    }
    if (num>0)                      // проверка что число>0
    {
        int root{static_cast<int>(sqrt(num))};              //инциализировал корень и посчитал его + явно указал необходимый тип данных
        if (root*root==num)                                 // проверка что корень вычисляется 
        {
            cout << "Корень числа = " << root << "\n";              //вывод если корень вычисляется
        }
        else
        {
            cout << "Корень не извлекается" << "\n";                  // вывод если корень не извлекается
        }
    }
    else            //если число отрицательное 
    {
        cout << "Квадрат числа = " << num*num << "\n";          // вывод квадрата числа если число отрицательное 
    }
}


void advanced()                         // функция повышенного уровня 
{
    const double EPSILON=1e-9;              //константа для проверки условия тк тип дабл 
    double a,b,c;                           // объявление переменных
    cout << "Введите стороны треугольника" << "\n";             //предложение ввода
    cin >> a >> b >> c;                                     //ввод
    if (cin.fail() || a<=0 || b<=0 || c<=0)                 //проверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Введен неверный тип данных, введите положительные числа" << "\n";          //сообщение об ошибке ввода
        return;
    }
    vector<double> sortirovka{a,b,c};               //массив для сортировки чисел
    sort(sortirovka.begin(),sortirovka.end());          //сортировка чисел
    a=sortirovka[0];        
    b=sortirovka[1];                    //упорядочил элементы
    c=sortirovka[2];
    if (abs(c*c-(a*a+b*b))<EPSILON)                     //проверка что стороны могут являться сторонами прямоугольного треугольника
    {
        cout << "Стороны могут быть сторонами прямоугольного треугольника" << "\n";             //вывод если стороны могут быть сторонами прямоугольного треугольника
    }
    else
    {
        cout << "Стороны не могут быть сторонами прямоугольного треугольника" << "\n";          //вывод если стороны не могут быть сторонами прямоугольного треугольника
    }
}


int main()                      
{
    int task_level;             //переменная выбора уровня программы 
    cout << "Введите уровень программы" << "\n" << "1 базовый" << "\n" << "2 средний" << "\n" << "3 повышенный" << "\n";   //предложение ввода и выбора уровня программы
    cin >> task_level;      //ввод
    if (cin.fail() || task_level<1 || task_level>3)         //проверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Введен неверный тип данных, введите 1 или 2 или 3" << "\n";        //сообщение об ошибке ввода
        return 0;
    }
    if (task_level==1)              //если выбран базовый уровень
    {       
        base();                     //вызов функции базового уровня
    }
    else if (task_level==2)             // если выбран средний уровен
    {
        medium();                   //вызов функции среднего уровня
    }
    else if (task_level==3)         //если выбран повышенный уровень 
    {
        advanced();                 //вызов функции повышенного уровня
    }
    else
    {
        cout << "Введен неверный тип данных, введите 1 или 2 или 3" << "\n";        //сообщение об ошибке ввода
    }
    return 0;
}