#include<iostream>
#include<cstdlib>       //для случайных чисел
#include<ctime>         //для случайных чисел
using namespace std;


//функция задачи базового уровня
void base()
{
    const int SIZE=20;          //константный размер массива 20 элементов
    int arr[SIZE];      //сам массив
    for (int i=0;i<SIZE;i++)        //цикл для заполнения массива
    {
        arr[i]=10+rand()%90;        //заполнение случайными элементами
    }
    for (int i=0;i<SIZE;i++)
    {
        cout << arr[i] << " ";      //показываю получившийся массив
    }
    cout << "\n";
    int ans{0};           //счетчик
    for (int i=0;i<SIZE;i++)        //иду по массиву
    {
        if (arr[i]>50)              // проверяю что элемент>50
        {
            ans++;                  //если >50 увеличиваю счетчик
        }
    }
    cout << "Количество элементов больше 50 " << ans << "\n";       //вывод
}


//функция задачи среднего уровня
void medium()
{
    const int SIZE=15;          //константный размер массива 15 элементов
    int arr[SIZE];      //сам массив
    int maxnum{0};        //инициализировал переменную для максимального числа с значением 0 тк числа в массиве будут 0-100
    for (int i=0;i<SIZE;i++)        //цикл для заполнения массива
    {
        arr[i]=rand()%101;        //заполнение случайными элементами
        if (arr[i]>maxnum)          //сразу после добавления элемента проверяю будет ли он наибольшим
        {
            maxnum=arr[i];          //если наибольший присваиваю переменной его значение
        }
    }
    for (int i=0;i<SIZE;i++)
    {
        cout << arr[i] << " ";      //показываю получившийся массив
    }
    cout << "\n";
    int ans{0};     //инициализация переменной счетчика 
    for (int i=0;i<SIZE;i++)
    {
        if (arr[i]==maxnum)         //проверяю является ли элемент максимальным
        {
            ans++;          //если является увеличиваю количетсво встреч
        }
    }
    cout << "Максимальный элемент массива встречается " << ans << " раз" << "\n";        //вывод
}


//функция задачи повышенного уроня
void advanced()
{
    const int SIZE=20;          //константный размер массива 20 элементов
    int arr[SIZE];      //сам массив
    for (int i=0;i<SIZE;i++)        //цикл для заполнения массива
    {
        arr[i]=1+rand()%100;        //заполнение случайными элементами
    }
    for (int i=0;i<SIZE;i++)
    {
        cout << arr[i] << " ";      //массив до сортировки
    }
    cout << "\n";
    for (int i=0;i<SIZE-1;i++)            //бабл сорт
    {
        for (int j=0;j<SIZE-1-i;j++)
        {
            if (arr[j]>arr[j+1])
            {
                swap(arr[j],arr[j+1]);
            }
        }
    }
    for (int i=0;i<SIZE;i++)
    {
        cout << arr[i] << " ";      //массив после сортировки
    }
    cout << "\n";
    double mediana{static_cast<double>(arr[9]+arr[10])/2};      //инициализация переменной медианы с ее расчетом
    cout << "Медиана отсортированного массива " << mediana << "\n";         //вывод
}


int main()
{
    srand(static_cast<unsigned>(time(nullptr)));    //для случайных чисел
    int task_level; //переменная уровня задачи
    cout << "Выберите уровень программы" << "\n" << "1 базовый" << "\n" << "2 средний" << "\n" << "3 повышенный" << "\n"; //предложение выбора уровня задачи
    cin >> task_level; //ввод уровня задачи
    if (cin.fail())     //проверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Ошибка ввода, введите 1 или 2 или 3";  //сообщение об ошибке ввода
        return 0;
    }
    switch(task_level)      //обработка выбора уровня через свитч
    {
        case 1: base();         //базовый
        break;
        case 2: medium();           //средний
        break;
        case 3: advanced();             //повышенный
        break;
        default: 
        cout << "Введен неверный уровень задания, введите 1 или 2 или 3";       //ввели дпугое
        return 0;
    }
    return 0;
}