#include<iostream>
#include<vector>        //для матриц
#include<cstdlib>       //для случайных чисел
#include<ctime>         //для случайных чисел
using namespace std;

//функция задачи базового уровня
void base()
{
    vector<vector<double>> matrix(4,vector<double>(4));     //матрица
    cout << "Введите элементы матрицы" << "\n";         //предложение ввода элементов матрицы
    for (int i=0;i<4;i++)       //циклы заполнения матрицы
    {
        for (int j=0;j<4;j++)
        {
            cin >> matrix[i][j];        //ввод элементов матрицы
        }
    }
    cout << "Исходная матрица:" << "\n";        //показываю исходную матрицу
    for (int i=0;i<4;i++)                       //циклы вывода исходной матрицы
    {
        for (int j=0;j<4;j++)
        {
            cout << matrix[i][j] << " ";       //вывод исходных элементов 
        }
        cout << "\n";                           // для вывода в виде матрицы
    }
    cout << "Элементы выше главной диагонали:" << "\n";         //вывожу элементы выше главной диагонали
    for (int i=0;i<4;i++)       //циклы вывода элементов выше главной диагонали 
    {
        for (int j=0;j<4;j++)
        {
            if (j>i)             //проверяю что они выше главной диагонали 
            {
                cout << matrix[i][j] << " ";        //вывожу элементы выше главной диагонали 
            }
        }
    }
}

//функция задачи среднего уровня
void medium()
{
    vector<vector<double>> matrix(3,vector<double>(3));//матрица
    for (int i=0;i<3;i++)   //циклы заполнения матрицы случайными элементами
    {
        for (int j=0;j<3;j++)
        {
            matrix[i][j]=1+rand()%100;          //заполнение матрицы случайными элементами
        }
    }
    cout << "Исходная матрица:" << "\n";        //показываю исходную матрицу
    for (int i=0;i<3;i++)           //циклы для вывода исходной матрицы
    {
        for (int j=0;j<3;j++)
        {
            cout << matrix[i][j] << " ";        //вывод элементов исходной матрицы
        }
        cout << "\n";                           //для вывода в виде матрицы
    }
    vector<double> values;                      //массив для проверки условия задачи 
    double sumfdiagonal{0},sumsdiagonal{0};     //переменные для значений суммы главной и побочной диагоналей 
    for (int i=0;i<3;i++)                          //циклы для подсчета сумм элементов главной и побочной диагоналей 
    {
        for (int j=0;j<3;j++)
        {
            if (i==j)       //главная диагональ
            {
                sumfdiagonal+=matrix[i][j];    //суммирую элементы главной дигонали     
            }
            if (j+i==2)     //побочная диагональ 
            {
                sumsdiagonal+=matrix[i][j];     //суммирую элементы побочной диагонали
            }
        }
    }
    if (sumfdiagonal==sumsdiagonal)     //чтобы за меньшее количество итераций завершить программу в случае если не магический квадрат  
    {
        for (int i=0;i<3;i++)       //циклы для сумм строк и столбцов 
        {
            double sumstr{0}, sumstolb{0};      //переменные сумм строк и столбцов 
            for (int j=0;j<3;j++)               //цикл расчета сумм строк и столбцов 
            {
                sumstr+=matrix[i][j];           //сумма значений строки 
                sumstolb+=matrix[j][i];         //сумма значений столбца 
            }
            values.push_back(sumstr);           //добавляю в массив сумму строк 
            values.push_back(sumstolb);         //добавляю в массив сумму столбцов 
        }
        bool flag=1;            //для проверки итогового условия 
        for (int i=0;i<6;i++)           //цикл для проверки итогового условия 
        {
            if (values[i]!=sumfdiagonal)        //проверка условия 
            {
                flag=0;                 //если условие не соблюдается
                break;                  // остановка цикла чтобы дальше не проверять (меньше итераций)
            }
        }   
        if (flag)               //проверка соблюдается итоговое условие или нет 
        {
            cout << "Матрица является магическим квадратом" << "\n";            //вывод если да 
        }
        else
        {
            cout << "Матрица не является магическим квадратом" << "\n";         //вывод если нет
        }
    }
    else
    {
        cout << "Матрица не является магическим квадратом" << "\n";             //вывод если нет для раннего условия 
    }
}

//функция для задачи повышенного уровня 
void advanced()
{
    vector<vector<double>> matrix(5,vector<double>(5));         //матрица 
    for (int i=0;i<5;i++)           //циклы для заполнения матрицы 
    {
        for (int j=0;j<5;j++)
        {
            matrix[i][j]=1+rand()%100;          //заполнение матрицы случайными числами
        }
    }
    cout << "Исходная матрица:" << "\n";        //показываю исходную матрицу 
    for (int i=0;i<5;i++)
    {
        for (int j=0;j<5;j++)
        {
            cout << matrix[i][j] << " ";        //вывод элементов матрицы
        }
        cout << "\n";                           //чтобы было в виде матрицы
    }
    cout << "Введите значения строки, которую хотите добавить в матрицу" << "\n";           //предложение ввода строки матрицы
    vector<double> values(5);       //массив для значений строки добавляемой в матрицу 
    for (int i=0;i<5;i++)           //цикл для заполнения массива
    {
        cin >> values[i];           //заполнение массива 
    }
    matrix.push_back(values);       //добавляю строку в матрицу через пушбек 
    cout << "Матрица с добавленной строкой:" << "\n";           //показываю матрицу после добавления строки
    for (int i=0;i<6;i++)           //циклы вывода измененной матрицы
    {
        for (int j=0;j<5;j++)   
        {
            cout << matrix[i][j] << " ";        //вывод элементов матрицы
        }
        cout << "\n";                           //чтобы было в виде матрицы
    }
}


int main()
{
    srand(static_cast<unsigned>(time(nullptr)));    //для случайных чисел
    int task_level; //переменная уровня задачи
    cout << "Выберите уровень программы" << "\n" << "1 базовый" << "\n" << "2 средний" << "\n" << "3 повышенный" << "\n"; //предложение выбора уровня задачи
    cin >> task_level; //ввод уровня задачи
    if (cin.fail())     //проверка ввода
    {
        cin.clear();
        cin.ignore(10000,'\n');
        cout << "Ошибка ввода, введите 1 или 2 или 3";  //сообщение об ошибке ввода
        return 0;
    }
    switch(task_level)      //обработка выбора уровня через свитч
    {
        case 1: base();         //базовый
        break;
        case 2: medium();           //средний
        break;
        case 3: advanced();             //повышенный
        break;
        default: 
        cout << "Введен неверный уровень задания, введите 1 или 2 или 3";       //ввели другое
        return 0;
    }
    return 0;
}